<h1><center><font color="blue">WALGAB CAREER INSTITUTE DATA ANALYSIS MONTH ONE (#0) ASSESMENT NOTEBOOK</font></center></h1>

# Instructions
- Answer All Questions
- Read the submission instructions at the foot of the notebook and ensure total compliance
- Enjoy the rhythm!

# Getting started with LIST

In [1]:

orders = [
    [1, "John", "Shoes", 75, "Delivered"],
    [2, "Mary", "Bag", 50, "Pending"],
    [3, "Paul", "Watch", 120, "Shipped"],
    [4, "Grace", "Laptop", 1100, "Delivered"],
    [5, "James", "Phone", 650, "Cancelled"],
    [6, "John", "Phone", 600, "Delivered"],
    [7, "Mary", "Shoes", 80, "Delivered"],
    [8, "Kelvin", "Refridgerator", 750000, "Delivered"]
]
orders

[[1, 'John', 'Shoes', 75, 'Delivered'],
 [2, 'Mary', 'Bag', 50, 'Pending'],
 [3, 'Paul', 'Watch', 120, 'Shipped'],
 [4, 'Grace', 'Laptop', 1100, 'Delivered'],
 [5, 'James', 'Phone', 650, 'Cancelled'],
 [6, 'John', 'Phone', 600, 'Delivered'],
 [7, 'Mary', 'Shoes', 80, 'Delivered'],
 [8, 'Kelvin', 'Refridgerator', 750000, 'Delivered']]


### ðŸ“ Exercise 1
- Add a new order record to the `orders` list.  
- Try printing only the last 3 orders from the dataset.

In [2]:
# Task one
new_order = [9, "Ben", "Books", "5000", "Delivered"]

orders.insert(8, new_order)
print(orders)

[[1, 'John', 'Shoes', 75, 'Delivered'], [2, 'Mary', 'Bag', 50, 'Pending'], [3, 'Paul', 'Watch', 120, 'Shipped'], [4, 'Grace', 'Laptop', 1100, 'Delivered'], [5, 'James', 'Phone', 650, 'Cancelled'], [6, 'John', 'Phone', 600, 'Delivered'], [7, 'Mary', 'Shoes', 80, 'Delivered'], [8, 'Kelvin', 'Refridgerator', 750000, 'Delivered'], [9, 'Ben', 'Books', '5000', 'Delivered']]

In [3]:
# Task Two
orders[6:]

[[7, 'Mary', 'Shoes', 80, 'Delivered'],
 [8, 'Kelvin', 'Refridgerator', 750000, 'Delivered'],
 [9, 'Ben', 'Books', '5000', 'Delivered']]

# 2ï¸âƒ£ Transforming List â†’ Dictionary


### ðŸ“ Exercise 2
- Following the precedeure taught in class, transform the above list into a dictionary
- Change the `Status` of the order on `index 1` to `"Returned"`.  
- Print all orders for `John`.

In [4]:
# Create dictionary from existing list
# Task one
orders_dict = {
    "Transaction_id":[1, 2, 3, 4, 5, 6,7, 8, 9],
    "Name":["John", "Mary", "Paul", "Grace", "James", "John", "Mary", "Kelvin", "Ben"],
    "Product":["Shoes", "Bag", "Watch", "Laptop", "Phone", "Phone", "Shoes", "Refrigerator", "Books"],
    "Price":[75.00, 50.00, 120.00, 1100.00, 650.00, 600.00, 80.00, 750000.00, 5000.00],
    "Status":["Delivered", "Pending", "Shipped", "Delivered", "Cancelled", "Delivered", "Delivered", "Delivered", "Delivered"]
               
}

print(orders_dict)

{'Transaction_id': [1, 2, 3, 4, 5, 6, 7, 8, 9], 'Name': ['John', 'Mary', 'Paul', 'Grace', 'James', 'John', 'Mary', 'Kelvin', 'Ben'], 'Product': ['Shoes', 'Bag', 'Watch', 'Laptop', 'Phone', 'Phone', 'Shoes', 'Refrigerator', 'Books'], 'Price': [75.0, 50.0, 120.0, 1100.0, 650.0, 600.0, 80.0, 750000.0, 5000.0], 'Status': ['Delivered', 'Pending', 'Shipped', 'Delivered', 'Cancelled', 'Delivered', 'Delivered', 'Delivered', 'Delivered']}

In [5]:
# Task two
orders[2] [4] = "Returned"

print(orders)

[[1, 'John', 'Shoes', 75, 'Delivered'], [2, 'Mary', 'Bag', 50, 'Pending'], [3, 'Paul', 'Watch', 120, 'Returned'], [4, 'Grace', 'Laptop', 1100, 'Delivered'], [5, 'James', 'Phone', 650, 'Cancelled'], [6, 'John', 'Phone', 600, 'Delivered'], [7, 'Mary', 'Shoes', 80, 'Delivered'], [8, 'Kelvin', 'Refridgerator', 750000, 'Delivered'], [9, 'Ben', 'Books', '5000', 'Delivered']]

# 3ï¸âƒ£ Dictionary â†’ Pandas DataFrame


## ðŸ“ Exercise 3
- Follow the structure below to transform the `orders_dict` into tabular data using pandas library
- Select only the rows where `Status` is `"Delivered"`.  
- Display only the `Customer` and `Price` columns.

In [6]:
# install depency 

# import dependency 
...

# view transformed data
transformed_data = ...

In [7]:
pip install pandas

Requirement already satisfied: pandas in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [8]:
pip install pandas

Requirement already satisfied: pandas in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\mercy\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [9]:
#transform the orders_dict into tabular data
import pandas as pd
transformed_data = pd.DataFrame(orders_dict)

In [10]:
#Change the Status of the order on index 1 to "Returned uing Var.at....
transformed_data.at[1, "Status"] ="Returned"

In [11]:
print(transformed_data)

   Transaction_id    Name       Product     Price     Status
0               1    John         Shoes      75.0  Delivered
1               2    Mary           Bag      50.0   Returned
2               3    Paul         Watch     120.0    Shipped
3               4   Grace        Laptop    1100.0  Delivered
4               5   James         Phone     650.0  Cancelled
5               6    John         Phone     600.0  Delivered
6               7    Mary         Shoes      80.0  Delivered
7               8  Kelvin  Refrigerator  750000.0  Delivered
8               9     Ben         Books    5000.0  Delivered

In [12]:
transformed_data

   Transaction_id    Name       Product     Price     Status
0               1    John         Shoes      75.0  Delivered
1               2    Mary           Bag      50.0   Returned
2               3    Paul         Watch     120.0    Shipped
3               4   Grace        Laptop    1100.0  Delivered
4               5   James         Phone     650.0  Cancelled
5               6    John         Phone     600.0  Delivered
6               7    Mary         Shoes      80.0  Delivered
7               8  Kelvin  Refrigerator  750000.0  Delivered
8               9     Ben         Books    5000.0  Delivered

In [13]:
transformed_data.head(2)

   Transaction_id  Name Product  Price     Status
0               1  John   Shoes   75.0  Delivered
1               2  Mary     Bag   50.0   Returned

In [14]:
transformed_data.tail(2)

   Transaction_id    Name       Product     Price     Status
7               8  Kelvin  Refrigerator  750000.0  Delivered
8               9     Ben         Books    5000.0  Delivered

In [15]:
transformed_data.shape

(9, 5)

In [16]:
transformed_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Transaction_id  9 non-null      int64
 1   Name            9 non-null      object
 2   Product         9 non-null      object
 3   Price           9 non-null      float64
 4   Status          9 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 492.0+ bytes

In [17]:
transformed_data.count()

Transaction_id    9
Name              9
Product           9
Price             9
Status            9
dtype: int64

In [21]:
transformed_data.nunique()

Transaction_id    9
Name              7
Product           7
Price             9
Status            4
dtype: int64

In [22]:
transformed_data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [18]:
#Display only the Customer and Price columns.
print(transformed_data[["Name", "Price"]])

     Name     Price
0    John      75.0
1    Mary      50.0
2    Paul     120.0
3   Grace    1100.0
4   James     650.0
5    John     600.0
6    Mary      80.0
7  Kelvin  750000.0
8     Ben    5000.0

In [19]:
#Select only the rows where Status is "Delivered
transformed_data[transformed_data["Status"] == "Delivered"]

   Transaction_id    Name       Product     Price     Status
0               1    John         Shoes      75.0  Delivered
3               4   Grace        Laptop    1100.0  Delivered
5               6    John         Phone     600.0  Delivered
6               7    Mary         Shoes      80.0  Delivered
7               8  Kelvin  Refrigerator  750000.0  Delivered
8               9     Ben         Books    5000.0  Delivered

In [20]:
#Print all orders for John.
transformed_data[transformed_data["Name"] == "John"]

   Transaction_id  Name Product  Price     Status
0               1  John   Shoes   75.0  Delivered
5               6  John   Phone  600.0  Delivered

<h1>Submission Instructions</h1>
<ul>
    <li>Complete all assesments</li>
    <li>Attach your notebook and submit with your name on the subject to walgabcareerinstitute@gmail.com</li>
    <li>All submissions must be made on or before 12:00pm on Tuesday, 16th September, 2025.</li>
</ul>